aaron-bond.better-comments
adpyke.codesnap
aleksa-codes.one-dark-modern-pro
anthropic.claude-code
anysphere.cursorpyright
bradlc.vscode-tailwindcss
cameron.vscode-pytest
codeandstuff.package-json-upgrade
datoux.vscode-pytest-intellisence
dbaeumer.vscode-eslint
deinsoftware.vitest-snippets
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
figma.figma-vscode-extension
formulahendry.auto-rename-tag
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
ibm.output-colorizer
jock.svg
kevinrose.vsc-python-indent
kingwl.vscode-vitest-runner
kisstkondoros.vscode-gutter-preview
mechatroner.rainbow-csv
meta.pyrefly
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-vscode.live-server
ms-vscode.powershell
naumovs.color-highlight
neonxp.gotools
nickmillerdev.pytest-fixtures
njqdev.vscode-python-typehint
oderwat.indent-rainbow
orta.vscode-jest
pamaron.pytest-runner
pkief.material-icon-theme
postman.postman-for-vscode
prisma.prisma
ritwickdey.liveserver
saoudrizwan.claude-dev
shd101wyy.markdown-preview-enhanced
shiro.pythonpack
steoates.autoimport
streetsidesoftware.code-spell-checker
tomrijndorp.find-it-faster
usernamehw.errorlens
vitest.explorer
wix.vscode-import-cost
yoavbls.pretty-ts-errors

